#+TITLE: Patch History
#+SETUPFILE: comfy_inline.theme
#+INCLUDE: code.inc

* Setup
Here are commonly used scripts/files that are used to collect statistics in this report.

Script: ~collect-v1model-no-stf~
#+begin_src shell :eval no :tangle collect-v1model-no-stf
#!/bin/sh
grep -rlE 'include <v1model\.p4>|include "v1model\.p4"' p4c/testdata/p4_16_samples | while read p4file; do if [ ! -f "${p4file%.p4}.stf" ]; then echo "$p4file"; fi; done
#+end_src

Script: ~run-p4testgen~
#+begin_src shell :eval no :tangle run-p4testgen
#!/bin/bash
p4testgen --arch v1model --target bmv2 -I p4include --max-tests 10 --out-dir ./1-testgen --test-backend stf "$1"
#+end_src

Directory ~1-testgen~ is created as such:
#+begin_src shell :eval no
# generate up to 10 tests for each P4 program targeting v1model
./collect-v1model-no-stf | xargs -I{} ./run-p4testgen {}
#+end_src

* Statistics
In the P4C repository ([[https://github.com/kaist-plrg/p4c/tree/ba98dee3bd8df212217f1ea8a1d61817a2a7a8e4][ba98dee3b]]), there are call_count-all-v1model-stfs() P4 programs that target the V1Model architecture.
We test P4-SpecTec against a total of call_count-all-p4spectec-stfs() P4-STF pairs. They consist of call_p4-with-stf() pairs provided by the P4C repository, call_count-testgen-stfs() pairs generated by P4Testgen and call_count-custom-stfs() custom tests for testing for loop.

** V1Model programs _with_ STF file
There are call_p4-with-stf() P4 programs that target V1Model and have an STF file.

#+NAME: p4-with-stf
#+begin_src shell :results output :exports both
# simply negate the condition in `collect-v1model-no-stf`
grep -rlE 'include <v1model\.p4>|include "v1model\.p4"' p4c/testdata/p4_16_samples | while read p4file; do if [ -f "${p4file%.p4}.stf" ]; then echo "$p4file"; fi; done | wc -l
#+end_src

#+RESULTS: p4-with-stf
: 203

** V1Model programs _without_ STF file
There are call_count-lines(data=collect-v1model-no-stf) P4 programs that target V1Model and lack an STF file.

#+NAME: collect-v1model-no-stf
#+begin_src shell :results output
./collect-v1model-no-stf | sort -u
#+end_src

#+RESULTS: collect-v1model-no-stf
#+begin_example
p4c/testdata/p4_16_samples/action_profile-bmv2.p4
p4c/testdata/p4_16_samples/action_profile_max_group_size_annotation.p4
p4c/testdata/p4_16_samples/action_profile_sum_of_members_annotation.p4
p4c/testdata/p4_16_samples/actions-almost-duplicate-names1.p4
p4c/testdata/p4_16_samples/action_selector_shared-bmv2.p4
p4c/testdata/p4_16_samples/action_selector_unused-bmv2.p4
p4c/testdata/p4_16_samples/action-synth.p4
p4c/testdata/p4_16_samples/action-two-params.p4
p4c/testdata/p4_16_samples/annotation-inline-propagate.p4
p4c/testdata/p4_16_samples/basic2-bmv2.p4
p4c/testdata/p4_16_samples/basic_routing-bmv2.p4
p4c/testdata/p4_16_samples/bool_to_bit_cast.p4
p4c/testdata/p4_16_samples/bvec_union-bmv2.p4
p4c/testdata/p4_16_samples/concat-bmv2.p4
p4c/testdata/p4_16_samples/control-hs-index-test1.p4
p4c/testdata/p4_16_samples/control-hs-index-test2.p4
p4c/testdata/p4_16_samples/control-hs-index-test3.p4
p4c/testdata/p4_16_samples/control-hs-index-test4.p4
p4c/testdata/p4_16_samples/control-hs-index-test5.p4
p4c/testdata/p4_16_samples/control-hs-index-test6.p4
p4c/testdata/p4_16_samples/copyprop1.p4
p4c/testdata/p4_16_samples/crc32-bmv2.p4
p4c/testdata/p4_16_samples/custom-type-restricted-fields.p4
p4c/testdata/p4_16_samples/dash/dash-pipeline-v1model-bmv2.p4
p4c/testdata/p4_16_samples/def-use.p4
p4c/testdata/p4_16_samples/drop-bmv2.p4
p4c/testdata/p4_16_samples/empty-bmv2.p4
p4c/testdata/p4_16_samples/extract_for_header_union.p4
p4c/testdata/p4_16_samples/fabric_20190420/fabric.p4
p4c/testdata/p4_16_samples/fabric_20190420/include/control/acl.p4
p4c/testdata/p4_16_samples/fabric_20190420/include/control/filtering.p4
p4c/testdata/p4_16_samples/fabric_20190420/include/control/forwarding.p4
p4c/testdata/p4_16_samples/fabric_20190420/include/control/next.p4
p4c/testdata/p4_16_samples/flowlet_switching-bmv2.p4
p4c/testdata/p4_16_samples/free-form-annotation.p4
p4c/testdata/p4_16_samples/gauntlet_inout_slice_table_key-bmv2.p4
p4c/testdata/p4_16_samples/gauntlet_lookahead_expansion-bmv2.p4
p4c/testdata/p4_16_samples/global_action_after_exit.p4
p4c/testdata/p4_16_samples/graph-annotationless-key.p4
p4c/testdata/p4_16_samples/hash-bmv2.p4
p4c/testdata/p4_16_samples/hashing-non-tuple-bmv2.p4
p4c/testdata/p4_16_samples/hdr_stacks2345.p4
p4c/testdata/p4_16_samples/header-bmv2.p4
p4c/testdata/p4_16_samples/hit-expr-bmv2.p4
p4c/testdata/p4_16_samples/init-entries-bmv2.p4
p4c/testdata/p4_16_samples/inline-bmv2.p4
p4c/testdata/p4_16_samples/inline-stack-bmv2.p4
p4c/testdata/p4_16_samples/intrinsic-bmv2.p4
p4c/testdata/p4_16_samples/invalid-hdr-warnings1.p4
p4c/testdata/p4_16_samples/invalid-hdr-warnings2.p4
p4c/testdata/p4_16_samples/invalid-hdr-warnings4.p4
p4c/testdata/p4_16_samples/invalid-hdr-warnings5.p4
p4c/testdata/p4_16_samples/invalid-hdr-warnings6.p4
p4c/testdata/p4_16_samples/issue1001-1-bmv2.p4
p4c/testdata/p4_16_samples/issue1001-bmv2.p4
p4c/testdata/p4_16_samples/issue1043-bmv2.p4
p4c/testdata/p4_16_samples/issue1062-bmv2.p4
p4c/testdata/p4_16_samples/issue1079-bmv2.p4
p4c/testdata/p4_16_samples/issue1097-bmv2.p4
p4c/testdata/p4_16_samples/issue1107.p4
p4c/testdata/p4_16_samples/issue1127-bmv2.p4
p4c/testdata/p4_16_samples/issue1193-bmv2.p4
p4c/testdata/p4_16_samples/issue1210.p4
p4c/testdata/p4_16_samples/issue1291-bmv2.p4
p4c/testdata/p4_16_samples/issue1304.p4
p4c/testdata/p4_16_samples/issue1325-bmv2.p4
p4c/testdata/p4_16_samples/issue134-bmv2.p4
p4c/testdata/p4_16_samples/issue1352-bmv2.p4
p4c/testdata/p4_16_samples/issue1386.p4
p4c/testdata/p4_16_samples/issue1406.p4
p4c/testdata/p4_16_samples/issue1409-bmv2.p4
p4c/testdata/p4_16_samples/issue1412-bmv2.p4
p4c/testdata/p4_16_samples/issue1470-bmv2.p4
p4c/testdata/p4_16_samples/issue1478-bmv2.p4
p4c/testdata/p4_16_samples/issue1517-bmv2.p4
p4c/testdata/p4_16_samples/issue1520-bmv2.p4
p4c/testdata/p4_16_samples/issue1524.p4
p4c/testdata/p4_16_samples/issue1535.p4
p4c/testdata/p4_16_samples/issue1538.p4
p4c/testdata/p4_16_samples/issue1541.p4
p4c/testdata/p4_16_samples/issue1544-1-bmv2.p4
p4c/testdata/p4_16_samples/issue1544-2-bmv2.p4
p4c/testdata/p4_16_samples/issue1544-bmv2.p4
p4c/testdata/p4_16_samples/issue1560-bmv2.p4
p4c/testdata/p4_16_samples/issue1595.p4
p4c/testdata/p4_16_samples/issue1607-bmv2.p4
p4c/testdata/p4_16_samples/issue1630-bmv2.p4
p4c/testdata/p4_16_samples/issue1642-bmv2.p4
p4c/testdata/p4_16_samples/issue1653-bmv2.p4
p4c/testdata/p4_16_samples/issue1653-complex-bmv2.p4
p4c/testdata/p4_16_samples/issue1660-bmv2.p4
p4c/testdata/p4_16_samples/issue1670-bmv2.p4
p4c/testdata/p4_16_samples/issue1713-bmv2.p4
p4c/testdata/p4_16_samples/issue1739-bmv2.p4
p4c/testdata/p4_16_samples/issue1765-1-bmv2.p4
p4c/testdata/p4_16_samples/issue1765-bmv2.p4
p4c/testdata/p4_16_samples/issue1781-bmv2.p4
p4c/testdata/p4_16_samples/issue1814-bmv2.p4
p4c/testdata/p4_16_samples/issue1829-4-bmv2.p4
p4c/testdata/p4_16_samples/issue1834-bmv2.p4
p4c/testdata/p4_16_samples/issue1882-1-bmv2.p4
p4c/testdata/p4_16_samples/issue1882-bmv2.p4
p4c/testdata/p4_16_samples/issue1897-bmv2.p4
p4c/testdata/p4_16_samples/issue1937-1-bmv2.p4
p4c/testdata/p4_16_samples/issue1937-2-bmv2.p4
p4c/testdata/p4_16_samples/issue1937-3-bmv2.p4
p4c/testdata/p4_16_samples/issue1955.p4
p4c/testdata/p4_16_samples/issue1958.p4
p4c/testdata/p4_16_samples/issue1985.p4
p4c/testdata/p4_16_samples/issue1989-bmv2.p4
p4c/testdata/p4_16_samples/issue2044-bmv2.p4
p4c/testdata/p4_16_samples/issue-2123.p4
p4c/testdata/p4_16_samples/issue2148.p4
p4c/testdata/p4_16_samples/issue2190.p4
p4c/testdata/p4_16_samples/issue2201-bmv2.p4
p4c/testdata/p4_16_samples/issue2208.p4
p4c/testdata/p4_16_samples/issue2213-bmv2.p4
p4c/testdata/p4_16_samples/issue2248.p4
p4c/testdata/p4_16_samples/issue2258-bmv2.p4
p4c/testdata/p4_16_samples/issue2261.p4
p4c/testdata/p4_16_samples/issue2266.p4
p4c/testdata/p4_16_samples/issue2283_1-bmv2.p4
p4c/testdata/p4_16_samples/issue2289.p4
p4c/testdata/p4_16_samples/issue2291-bmv2.p4
p4c/testdata/p4_16_samples/issue2303.p4
p4c/testdata/p4_16_samples/issue2314.p4
p4c/testdata/p4_16_samples/issue2321.p4
p4c/testdata/p4_16_samples/issue232-bmv2.p4
p4c/testdata/p4_16_samples/issue2330-1.p4
p4c/testdata/p4_16_samples/issue2330.p4
p4c/testdata/p4_16_samples/issue2344.p4
p4c/testdata/p4_16_samples/issue2345-1.p4
p4c/testdata/p4_16_samples/issue2345-2.p4
p4c/testdata/p4_16_samples/issue2345-multiple_dependencies.p4
p4c/testdata/p4_16_samples/issue2345.p4
p4c/testdata/p4_16_samples/issue2345-with_nested_if.p4
p4c/testdata/p4_16_samples/issue2355.p4
p4c/testdata/p4_16_samples/issue2356.p4
p4c/testdata/p4_16_samples/issue2359.p4
p4c/testdata/p4_16_samples/issue2362-bmv2.p4
p4c/testdata/p4_16_samples/issue242.p4
p4c/testdata/p4_16_samples/issue2465-bmv2.p4
p4c/testdata/p4_16_samples/issue2495-bmv2.p4
p4c/testdata/p4_16_samples/issue249.p4
p4c/testdata/p4_16_samples/issue2657-bmv2.p4
p4c/testdata/p4_16_samples/issue2664-bmv2.p4
p4c/testdata/p4_16_samples/issue270-bmv2.p4
p4c/testdata/p4_16_samples/issue272-1-bmv2.p4
p4c/testdata/p4_16_samples/issue272-2-bmv2.p4
p4c/testdata/p4_16_samples/issue2726-bmv2.p4
p4c/testdata/p4_16_samples/issue2735-bmv2.p4
p4c/testdata/p4_16_samples/issue2735.p4
p4c/testdata/p4_16_samples/issue281.p4
p4c/testdata/p4_16_samples/issue2844-enum.p4
p4c/testdata/p4_16_samples/issue2904.p4
p4c/testdata/p4_16_samples/issue2905-bmv2.p4
p4c/testdata/p4_16_samples/issue297-bmv2.p4
p4c/testdata/p4_16_samples/issue298-bmv2.p4
p4c/testdata/p4_16_samples/issue3001-1.p4
p4c/testdata/p4_16_samples/issue3091.p4
p4c/testdata/p4_16_samples/issue3118-bmv2.p4
p4c/testdata/p4_16_samples/issue3225.p4
p4c/testdata/p4_16_samples/issue323.p4
p4c/testdata/p4_16_samples/issue-3312-graph-bmv2.p4
p4c/testdata/p4_16_samples/issue3329-bmv2.p4
p4c/testdata/p4_16_samples/issue3374.p4
p4c/testdata/p4_16_samples/issue3394.p4
p4c/testdata/p4_16_samples/issue3531.p4
p4c/testdata/p4_16_samples/issue355-bmv2.p4
p4c/testdata/p4_16_samples/issue356-bmv2.p4
p4c/testdata/p4_16_samples/issue361-bmv2.p4
p4c/testdata/p4_16_samples/issue364-bmv2.p4
p4c/testdata/p4_16_samples/issue3650.p4
p4c/testdata/p4_16_samples/issue3702-bmv2.p4
p4c/testdata/p4_16_samples/issue383-bmv2.p4
p4c/testdata/p4_16_samples/issue4057.p4
p4c/testdata/p4_16_samples/issue407-2.p4
p4c/testdata/p4_16_samples/issue407-3.p4
p4c/testdata/p4_16_samples/issue414-bmv2.p4
p4c/testdata/p4_16_samples/issue420.p4
p4c/testdata/p4_16_samples/issue422.p4
p4c/testdata/p4_16_samples/issue430-1-bmv2.p4
p4c/testdata/p4_16_samples/issue430-bmv2.p4
p4c/testdata/p4_16_samples/issue461-bmv2.p4
p4c/testdata/p4_16_samples/issue4739.p4
p4c/testdata/p4_16_samples/issue4835-generic-struct.p4
p4c/testdata/p4_16_samples/issue486-bmv2.p4
p4c/testdata/p4_16_samples/issue-4969-bmv2.p4
p4c/testdata/p4_16_samples/issue496.p4
p4c/testdata/p4_16_samples/issue512.p4
p4c/testdata/p4_16_samples/issue561-bmv2.p4
p4c/testdata/p4_16_samples/issue562-bmv2.p4
p4c/testdata/p4_16_samples/issue584-1-bmv2.p4
p4c/testdata/p4_16_samples/issue677-bmv2.p4
p4c/testdata/p4_16_samples/issue692-bmv2.p4
p4c/testdata/p4_16_samples/issue696-bmv2.p4
p4c/testdata/p4_16_samples/issue737-bmv2.p4
p4c/testdata/p4_16_samples/issue841.p4
p4c/testdata/p4_16_samples/issue887.p4
p4c/testdata/p4_16_samples/issue891-bmv2.p4
p4c/testdata/p4_16_samples/issue907-bmv2.p4
p4c/testdata/p4_16_samples/issue914-bmv2.p4
p4c/testdata/p4_16_samples/issue949.p4
p4c/testdata/p4_16_samples/issue955.p4
p4c/testdata/p4_16_samples/issue986-1-bmv2.p4
p4c/testdata/p4_16_samples/issue986-bmv2.p4
p4c/testdata/p4_16_samples/junk-prop-bmv2.p4
p4c/testdata/p4_16_samples/key1-bmv2.p4
p4c/testdata/p4_16_samples/logging-bmv2.p4
p4c/testdata/p4_16_samples/loop-3-clause-tricky2.p4
p4c/testdata/p4_16_samples/match-on-exprs2-bmv2.p4
p4c/testdata/p4_16_samples/multicast-bmv2.p4
p4c/testdata/p4_16_samples/mux-bmv2.p4
p4c/testdata/p4_16_samples/name_annotations_to_p4info-bmv2.p4
p4c/testdata/p4_16_samples/named_meter_1-bmv2.p4
p4c/testdata/p4_16_samples/named_meter_bmv2.p4
p4c/testdata/p4_16_samples/nested-actions-with-return-exit1.p4
p4c/testdata/p4_16_samples/nested_if_else.p4
p4c/testdata/p4_16_samples/nested_if_lvalue_dependencies.p4
p4c/testdata/p4_16_samples/nested_if_statement.p4
p4c/testdata/p4_16_samples/next-def-use.p4
p4c/testdata/p4_16_samples/nonstandard_table_names-bmv2.p4
p4c/testdata/p4_16_samples/omec/up4.p4
p4c/testdata/p4_16_samples/p416-type-use3.p4
p4c/testdata/p4_16_samples/parser-if.p4
p4c/testdata/p4_16_samples/parser-locals2.p4
p4c/testdata/p4_16_samples/parser-pragma.p4
p4c/testdata/p4_16_samples/parser-unroll-issue3537-1.p4
p4c/testdata/p4_16_samples/parser-unroll-issue3537.p4
p4c/testdata/p4_16_samples/parser-unroll-t1-cond.p4
p4c/testdata/p4_16_samples/parser-unroll-test10.p4
p4c/testdata/p4_16_samples/parser-unroll-test1.p4
p4c/testdata/p4_16_samples/parser-unroll-test2.p4
p4c/testdata/p4_16_samples/parser-unroll-test3.p4
p4c/testdata/p4_16_samples/parser-unroll-test4.p4
p4c/testdata/p4_16_samples/parser-unroll-test5.p4
p4c/testdata/p4_16_samples/parser-unroll-test6.p4
p4c/testdata/p4_16_samples/parser-unroll-test7.p4
p4c/testdata/p4_16_samples/parser-unroll-test8.p4
p4c/testdata/p4_16_samples/parser-unroll-test9.p4
p4c/testdata/p4_16_samples/pins/pins_fabric.p4
p4c/testdata/p4_16_samples/pins/pins_middleblock.p4
p4c/testdata/p4_16_samples/pins/pins_wbb.p4
p4c/testdata/p4_16_samples/pkginfo_annotation.p4
p4c/testdata/p4_16_samples/predication_issue_4.p4
p4c/testdata/p4_16_samples/predication_issue.p4
p4c/testdata/p4_16_samples/proliferation1.p4
p4c/testdata/p4_16_samples/pvs-bitstring-bmv2.p4
p4c/testdata/p4_16_samples/pvs-nested-struct.p4
p4c/testdata/p4_16_samples/pvs-struct-1-bmv2.p4
p4c/testdata/p4_16_samples/pvs-struct-2-bmv2.p4
p4c/testdata/p4_16_samples/pvs-struct-3-bmv2.p4
p4c/testdata/p4_16_samples/register-serenum-bmv2.p4
p4c/testdata/p4_16_samples/same_name_for_table_and_action.p4
p4c/testdata/p4_16_samples/scalarmeta-bmv2.p4
p4c/testdata/p4_16_samples/simplify_slice.p4
p4c/testdata/p4_16_samples/slice-def-use1.p4
p4c/testdata/p4_16_samples/slice-def-use.p4
p4c/testdata/p4_16_samples/stack-bmv2.p4
p4c/testdata/p4_16_samples/stack-bvec-bmv2.p4
p4c/testdata/p4_16_samples/std_meta_inlining.p4
p4c/testdata/p4_16_samples/strength3.p4
p4c/testdata/p4_16_samples/strength4-bmv2.p4
p4c/testdata/p4_16_samples/strength6.p4
p4c/testdata/p4_16_samples/struct_assignment_optimization.p4
p4c/testdata/p4_16_samples/structured_annotations.p4
p4c/testdata/p4_16_samples/structure-valued-expr-ok-1-bmv2.p4
p4c/testdata/p4_16_samples/table-entries-valid-bmv2.p4
p4c/testdata/p4_16_samples/table-key-serenum-bmv2.p4
p4c/testdata/p4_16_samples/union4-bmv2.p4
p4c/testdata/p4_16_samples/unused-counter-bmv2.p4
p4c/testdata/p4_16_samples/use-priority-as-name.p4
p4c/testdata/p4_16_samples/v1model-digest-containing-ser-enum.p4
p4c/testdata/p4_16_samples/v1model-digest-custom-type.p4
p4c/testdata/p4_16_samples/v1model-p4runtime-enumint-types1.p4
p4c/testdata/p4_16_samples/v1model-p4runtime-most-types1.p4
p4c/testdata/p4_16_samples/verify-bmv2.p4
p4c/testdata/p4_16_samples/verify_disjunction.p4
p4c/testdata/p4_16_samples/wrong-warning.p4
p4c/testdata/p4_16_samples/x-bmv2.p4
p4c/testdata/p4_16_samples/xor_test.p4
#+end_example

From those call_count-lines(data=collect-v1model-no-stf) programs, P4Testgen successfully generated call_count-testgen-stfs() tests for call_testgen-success() P4 programs.

#+NAME: testgen-success
#+begin_src shell :results output :exports both
# run p4testgen for programs without stf
./collect-v1model-no-stf | xargs ./run-p4testgen

# how many p4 programs are these tests for?
ls 1-testgen/*.stf \
    | sed -E 's/_[0-9]+\.stf$//' \
    | sort -u \
    | wc -l
#+end_src

#+RESULTS: testgen-success
: 258

Here are the call_count-lines(data=testgen-failed) programs that P4Testgen failed to create STF tests for.
#+NAME: testgen-failed
#+begin_src shell :results output :exports both
# programs without an stf
./collect-v1model-no-stf \
    | xargs -I{} basename {} \
    | sort -u \
    > v1model-all.txt
# programs without an stf, but has tests generated by p4testgen
ls 1-testgen/*.stf \
    | sed -E 's/_[0-9]+\.stf$/.p4/' \
    | xargs -I{} basename {} \
    | sort -u \
    > v1model-success.txt
# which programs did p4testgen fail to create tests for?
comm -23 v1model-all.txt v1model-success.txt
#+end_src

#+RESULTS: testgen-failed
#+begin_example
acl.p4
filtering.p4
forwarding.p4
invalid-hdr-warnings1.p4
issue1193-bmv2.p4
issue1304.p4
issue1517-bmv2.p4
issue1524.p4
issue1882-1-bmv2.p4
issue1882-bmv2.p4
issue2495-bmv2.p4
issue2664-bmv2.p4
issue2735.p4
issue3091.p4
issue407-2.p4
issue407-3.p4
issue4739.p4
issue841.p4
issue907-bmv2.p4
loop-3-clause-tricky2.p4
next.p4
parser-unroll-test10.p4
pvs-nested-struct.p4
#+end_example

* Patch Process
*All tests* generated by P4Testgen are automatically _patched_ and _grouped_ before they are used as tests in P4-SpecTec.

** Patch
Tests are automatically patched with a simple script called ~patch.ml~. Here are the changes it makes.
1. ~add~ statements are patched to use _qualified names_ for tables and _unqualified names_ for actions.
   1. Tests generated by P4Testgen use qualified names that look like ~MyIngress.t1~. ~patch.ml~ replaces parts like ~MyIngress~ to ~main.ig~. The same is done for egress.
   2. Action names are simply truncated to use unqualified names. In some cases, this alters program behavior because using an unqualified name could reference a different action. An example of this is [[https://github.com/kaist-plrg/p4-spectec/blob/concrete/testdata/p4testgen/actions-almost-duplicate-names1/actions-almost-duplicate-names1_5.stf][~actions-almost-duplicate-names1_5.stf~]]. The action name should be ~main.ig.baz~, but it is patched to truncate it to ~baz~, altering program behavior. Such tests are failing at the moment.
2. ~setdefault~ statements are patched to use _qualified names_ for tables. The method is identical to ~add~.
** Group
Every STF file is then grouped into a directory. For example, ~predication_issue_1.stf~ and ~predication_issue_2.stf~ are grouped and moved into ~predication_issue/~.
** Additional Patching
*Some tests* go through additional changes.

| FILENAME                               | CHANGES                                                                                             |
|----------------------------------------+-----------------------------------------------------------------------------------------------------|
| ~inline-bmv2_1.stf~                      | rename ~$valid$~ -> ~isValid<>()~                                                                       |
| ~issue298-bmv2_{1,2,3,4,5,7,8,9,10}.stf~ | @name annotation for struct fields are not yet supported. rename ~ingress_metadata~ -> ~local_metadata~ |

* Excludes

Here are the categories of files excluded from testing.

#+begin_src shell :results output :exports both
tree excludes/dynamic
#+end_src

#+RESULTS:
#+begin_example
excludes/dynamic
├── extern
│   └── function-not-implemented.exclude
├── p4c
│   └── todo
│       ├── function-as-lvalue.exclude
│       ├── hash-argument-type-mismatch.exclude
│       └── header-not-multiple-of-8.exclude
├── stf
│   └── loop.exclude
└── undefined-behavior
    └── index-out-of-bounds.exclude

6 directories, 6 files
#+end_example

| EXCLUDE                     | FILE COUNT | REASON                                                                                                         |
|-----------------------------+------------+----------------------------------------------------------------------------------------------------------------|
| function-not-implemented    |          1 | Uses an extern function that lacks an implementation                                                           |
| function-as-lvalue          |          1 | ~f().isValid()~ assumes that function call is an lvalue. Currently not the case in P4-SpecTec.                   |
| hash-argument-type-mismatch |          3 | The third argument to the V1Model extern ~hash~ needs to be a tuple. function calls in these files violate that. |
| header-not-multiple-of-8    |          1 | Error: BMv2 target only supports headers with fields totaling a multiple of 8 bits.                            |
| loop                        |          1 | Infinite loop program                                                                                          |
| index-out-of-bounds         |          3 | Expected result relies on how index access out of bounds behave, which is undefined behavior.                  |

* Results
These are the results of testing the P4-SpecTec SL interpreter against call_count-all-p4spectec-stfs() pairs.

** p4c tests:
#+begin_src shell :results output :exports results
tail -1 p4spec/test/sim/sim_v1model_p4c_sl.expected | cut -d':' -f2-
#+end_src

#+RESULTS:
:  [EXCLUDE] 4/203 (1.97%) [PASS] 199/203 (98.03%) [FAIL] 0/203 (0.00%)

** P4Testgen tests:
#+begin_src shell :results output :exports results
tail -1 p4spec/test/sim/sim_v1model_p4testgen_sl.expected | cut -d':' -f2-
#+end_src

#+RESULTS:
:  [EXCLUDE] 116/1037 (11.19%) [PASS] 904/1037 (87.17%) [FAIL] 17/1037 (1.64%)

** Custom tests:
#+begin_src shell :results output :exports results
tail -1 p4spec/test/sim/sim_v1model_custom_sl.expected | cut -d':' -f2-
#+end_src

#+RESULTS:
:  [EXCLUDE] 0/5 (0.00%) [PASS] 5/5 (100.00%) [FAIL] 0/5 (0.00%)
